app/controllers/juego_parametros_controller.rb

  def index
    @juego_parametros = JuegoParametro.all
---
SELECT "juego_parametros".* FROM "juego_parametros"

  def create
    @juego_parametro = JuegoParametro.new(juego_parametro_params)

    if @juego_parametro.save
---
INSERT INTO "juego_parametros" ("NumColumna", "NumFila", "numMinas", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["NumColumna", 3], ["NumFila", 3], ["numMinas", 1], ["created_at", "2020-02-13 06:54:38.058153"], ["updated_at", "2020-02-13 06:54:38.058153"]]

  def update
    if @juego_parametro.update(juego_parametro_params)
---
UPDATE "juego_parametros" SET "NumFila" = ?, "updated_at" = ? WHERE "juego_parametros"."id" = ?  [["NumFila", 7], ["updated_at", "2020-02-13 07:03:05.030539"], ["id", 2]]

    def set_juego_parametro
      @juego_parametro = JuegoParametro.find(params[:id])
---
SELECT  "juego_parametros".* FROM "juego_parametros" WHERE "juego_parametros"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]