app/controllers/juegos_controller.rb

SELECT "juegos".* FROM "juegos"
---
  def index
    @juegos = Juego.all

INSERT INTO "juegos" ("Usuario", "estatusJuego", "ResultadoJuego", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["Usuario", 6], ["estatusJuego", "FINALIZADO"], ["ResultadoJuego", "f"], ["created_at", "2020-02-13 07:18:39.545294"], ["updated_at", "2020-02-13 07:18:39.545294"]]
---
  def create
    @juego = Juego.new(juego_params)

    if @juego.save